import string
import epitran
from epitran import backoff

DATA_FOLDER = 'data'
SRC_LANGS = ['en']
TGT_LANGS = ['hi', 'es', 'de', 'nl', 'ta']
TRANSLATE_FNAMES = ['train', 'dev', 'test']
ALIGN_HEURISTICS = ['fast-align', 'affix-match']
ALL_PARTIAL_SUFFIXES = ['partial', 'all']

DOC_BEGIN_STR = '-DOCSTART-'

INDEX_TOKENS = 0
INDEX_POS_TAGS = 1
INDEX_CHUNKS = 2
INDEX_NER_TAGS = 3

SEED = 0

NER_TAGS = ['LOC', 'MISC', 'ORG', 'PER']
TAG_PREFIXES = ['B', 'I']
OUTSIDE_TAG = 'O'

PROCESSED_FILE_SUFFIX = '_processed'

# TGT_LANG_PUNCTUATIONS = string.punctuation + '।' + '&quot;'
# TGT_LANG_PUNCTUATIONS = string.punctuation
TGT_LANG_PUNCTUATIONS = ['।']
PKL_EXT = '.pkl'
TSV_EXT = '.tsv'
QUOTE = '&quot;'

FAST_ALIGN_SEP = ' ||| '
FAST_ALIGN_PATH = '/Users/articulab/Documents/code/fall_2018/fast_align/build'
FAST_ALIGN_OUTPUT_FNAME = 'forward.align'

BATCH_SIZE = 128

LEXICON_FILE_NAMES = ["lexicon_ground-truth", "lexicon_idc"]
MATCHING_ALGOS = ["token_match", "ipa_match"]


char_to_numeric = {'O': 0, 'LOC': 1, 'MISC': 2, 'ORG': 3, 'PER': 4}

gold_test_dict = dict()
gold_test_dict["en"] = {
    "documents": 946,
    "sentences": 14041,
    "tokens": 203621,
    "LOC": 7140,
    "MISC": 3438,
    "ORG": 6321,
    "PER": 6600
}

stop_word_dict = {"es": "spanish", "de": "german", "nl": "dutch"}
epi_dict = {"es": "spa-Latn", "de": "deu-Latn", "nl": "nld-Latn", "ta": "tam-Taml", "hi": "hin-Deva"}
stop_word_list_hi = ["अंदर","अत","अदि","अप","अपना","अपनि","अपनी","अपने","अभि","अभी","आदि","आप","इंहिं","इंहें",
                     "इंहों","इतयादि","इत्यादि","इन","इनका","इन्हीं","इन्हें","इन्हों","इस","इसका","इसकि","इसकी","इसके",
                     "इसमें","इसि","इसी","इसे","उंहिं","उंहें","उंहों","उन","उनका","उनकि","उनकी","उनके","उनको","उन्हीं","उन्हें",
                     "उन्हों","उस","उसके","उसि","उसी","उसे","एक","एवं","एस","एसे","ऐसे","ओर","और","कइ","कई","कर",
                     "करता","करते","करना","करने","करें","कहते","कहा","का","काफि","काफ़ी","कि","किंहें","किंहों","कितना",
                     "किन्हें","किन्हों","किया","किर","किस","किसि","किसी","किसे","की","कुछ","कुल","के","को","कोइ",
                     "कोई","कोन","कोनसा","कौन","कौनसा","गया","घर","जब","जहाँ","जहां","जा","जिंहें","जिंहों","जितना",
                     "जिधर","जिन","जिन्हें","जिन्हों","जिस","जिसे","जीधर","जेसा","जेसे","जैसा","जैसे","जो","तक","तब","तरह",
                     "तिंहें","तिंहों","तिन","तिन्हें","तिन्हों","तिस","तिसे","तो","था","थि","थी","थे","दबारा","दवारा","दिया",
                     "दुसरा","दुसरे","दूसरे","दो","द्वारा","न","नहिं","नहीं","ना","निचे","निहायत","नीचे","ने","पर","पहले","पुरा",
                     "पूरा","पे","फिर","बनि","बनी","बहि","बही","बहुत","बाद","बाला","बिलकुल","भि","भितर","भी","भीतर",
                     "मगर","मानो","मे","में","यदि","यह","यहाँ","यहां","यहि","यही","या","यिह","ये","रखें","रवासा","रहा",
                     "रहे","ऱ्वासा","लिए","लिये","लेकिन","व","वगेरह","वरग","वर्ग","वह","वहाँ","वहां","वहिं","वहीं","वाले",
                     "वुह","वे","वग़ैरह","संग","सकता","सकते","सबसे","सभि","सभी","साथ","साबुत","साभ","सारा","से","सो",
                     "हि","ही","हुअ","हुआ","हुइ","हुई","हुए","हे","हें","है","हैं","हो","होता","होति","होती","होते","होना",
                     "होने"]

stop_word_list_ta = ['என்று', 'மற்றும்', 'இந்த', 'இது', 'என்ற', 'கொண்டு', 'என்பது', 'பல', 'ஆகும்', 'அல்லது',
                     'அவர்', 'நான்', 'உள்ள', 'அந்த', 'இவர்', 'என', 'முதல்', 'என்ன', 'இருந்து', 'சில', 'என்',
                     'போன்ற', 'வேண்டும்', 'வந்து', 'இதன்', 'அது', 'அவன்', 'தான்', 'பலரும்', 'என்னும்', 'மேலும்',
                     'பின்னர்', 'கொண்ட', 'இருக்கும்', 'தனது', 'உள்ளது', 'போது', 'என்றும்', 'அதன்', 'தன்',
                     'பிறகு', 'அவர்கள்', 'வரை', 'அவள்', 'நீ', 'ஆகிய', 'இருந்தது', 'உள்ளன', 'வந்த', 'இருந்த',
                     'மிகவும்', 'இங்கு', 'மீது', 'ஓர்', 'இவை', 'இந்தக்', 'பற்றி', 'வரும்', 'வேறு', 'இரு', 'இதில்',
                     'போல்', 'இப்போது', 'அவரது', 'மட்டும்', 'இந்தப்', 'எனும்', 'மேல்', 'பின்', 'சேர்ந்த',
                     'ஆகியோர்', 'எனக்கு', 'இன்னும்', 'அந்தப்', 'அன்று', 'ஒரே', 'மிக', 'அங்கு', 'பல்வேறு',
                     'விட்டு', 'பெரும்', 'அதை', 'பற்றிய', 'உன்', 'அதிக', 'அந்தக்', 'பேர்', 'இதனால்',
                     'அவை', 'அதே', 'ஏன்', 'முறை', 'யார்', 'என்பதை', 'எல்லாம்', 'மட்டுமே', 'இங்கே',
                     'அங்கே', 'இடம்', 'இடத்தில்', 'அதில்', 'நாம்', 'அதற்கு', 'எனவே', 'பிற', 'சிறு', 'மற்ற',
                     'விட', 'எந்த', 'எனவும்', 'எனப்படும்', 'எனினும்', 'அடுத்த', 'இதனை', 'இதை', 'கொள்ள',
                     'இந்தத்', 'இதற்கு', 'அதனால்', 'தவிர', 'போல', 'வரையில்', 'சற்று', 'எனக்']


def get_allowed_tags():
    allowed_tags = []
    for tp in TAG_PREFIXES:
        for nt in NER_TAGS:
            allowed_tags.append(tp + '-' + nt)
    return allowed_tags


allowed_tags = get_allowed_tags() + [OUTSIDE_TAG]


def get_epi(lang):
    return epitran.Epitran(epi_dict[lang])
